import type { IEmployee } from '../types/employee.interface';

export const MOCK_EMPLOYEES: IEmployee[] = [
  {
    id: '0411d9b6-bec6-4f00-b88b-461679308e41',
    name: 'Иван Петров',
    date: '31.07.2000',
    salary: 50000,
  },
  {
    id: '0223d9b6-bec6-4f00-b88b-461679308e41',
    name: 'Анна Смирнова',
    date: '31.07.1997',
    salary: 60000,
  },
  {
    id: '0333d9b6-bec6-4f00-b88b-461679308e41',
    name: 'Дмитрий Иванов',
    date: '11.12.2003',
    salary: 75000,
  },
  {
    id: '0443d9b6-bec6-4f00-b88b-461679308e41',
    name: 'Елена Кузнецова',
    date: '01.07.2005',
    salary: 55000,
  },
  {
    id: '04553d9b6-bec6-4f00-b88b-461679308e41',
    name: 'Сергей Васильев',
    date: '31.05.1980',
    salary: 80000,
  },
  {
    id: '0466d9b6-bec6-4f00-b88b-461679308e41',
    name: 'Ольга Михайлова',
    date: '21.04.2000',
    salary: 62000,
  },
  {
    id: '0773d9b6-bec6-4f00-b88b-461679308e41',
    name: 'Алексей Новиков',
    date: '11.01.2001',
    salary: 70000,
  },
  {
    id: '0883d9b6-bec6-4f00-b88b-461679308e41',
    name: 'Наталья Федорова',
    date: '22.08.2003',
    salary: 58000,
  },
  {
    id: '9923d9b6-bec6-4f00-b88b-461679308e41',
    name: 'Павел Морозов',
    date: '05.07.2002',
    salary: 90000,
  },
  {
    id: '0513d9b6-bec6-4f00-b88b-461679308e41',
    name: 'Мария Волкова',
    date: '10.07.1993',
    salary: 65000,
  },
  {
    id: '0456d9b6-bec6-4f00-b88b-461679308e41',
    name: 'Андрей Лебедев',
    date: '19.07.1995',
    salary: 72000,
  },
  {
    id: '0423n9b6-bec6-4f00-b88b-461679308e41',
    name: 'Татьяна Козлова',
    date: '31.07.2000',
    salary: 68000,
  },
];
